{
	"404": {
		"descripton": "The content you are trying to reach at '/{{path}}' is not available.",
		"title": "404 - Content Not Found!"
	},
	"base-url": "C:\\Users\\alperaktas",
	"clippy": {
		"greeting": "Hello, I'm Clippy!"
	},
	"daily-space-palette": "Daily Space Palette is a webpage that generates color palettes from NASA's Astronomy Picture of the Day. The astronomy picture changes daily, and each day a new color palette is generated from the picture provided.",
	"exalt-rates": "A project that aims to provide a simple currency calculator for Path of Exile 2 players. The user can select a primary currency, enter an amount, and see view the exchange rates for other available currencies.",
	"error": {
		"fallback-element": "Oops! Looks like you broke my website! If you want to help me fix it, you can check the browser console for the error message and kindly send it to me, pretty please :)"
	},
	"introduction": {
		"menu": {
			"resume": "Resume"
		},
		"about-current-job": "Currently, I work at Etstur as a Software Development Assistant and I participate in developing React-based B2B web applications.",
		"about-experience": "Because of my profound interest in software development, I studied software through online content and solved test cases on websites like HackerRank to invest into the career that I desired to have during my studentship.",
		"about-me": "I am an English Language and Literature graduate from Ege University.",
		"about-preferences": "I generally prefer developing apps with TypeScript and React. Additionally, I write tests using Vitest and react-testing-library, and depending on the project, I may use Playwright as well."
	},
	"login-screen": {
		"footer-info": "After you log on, you can add or change accounts.",
		"instructions": "To begin, please enter your password",
		"turn-off": "Turn off computer"
	},
	"vigenere-cipher": {
		"alphabet": "Alphabet",
		"alphabet-disabled-tooltip": "Alphabet is currently restricted to only Latin characters",
		"decrypt": "Decrypt",
		"encrypt": "Encrypt",
		"input": "Input",
		"key": "Key",
		"key-descripton": "Key to use for '{{method}}' method",
		"method": "Method",
		"output": "Output",
		"title": "Vigenère Cipher"
	}
}
