{
	"404": {
		"descripton": "'{{path}}' dizininde erişmeye çalıştığınız içerik bulunamadı.",
		"title": "404 - İçerik Bulunamadı!"
	},
	"base-url": "C:\\Kullanıcılar\\alperaktas",
	"clippy": {
		"greeting": "Merhaba, ben Clippy!"
	},
	"daily-space-palette": "Daily Space Palette, NASA'nın Astronomy Picture of The Day sitesinde paylaştığı fotoğraftan renk paleti üreten bir web projesidir. Astronomi resmi günlük olarak değişir ve her gün o resimden yeni bir renk paleti üretilir.",
	"error": {
		"fallback-element": "Aman! Sanırım web sayfamı bozdun! Hatayı gidermem için yardımcı olmak istersen, tarayıcı konsolundaki hata  mesajını kontrol edip göndermeni önemle rica ediyorum :)"
	},
	"exalt-rates": "Path of Exile 2 oyuncuları için basit bir para birimi hesaplayıcısı sağlamayı amaçlayan bir proje. Kullanıcı birincil bir para birimi seçebilir, bir miktar girebilir ve diğer mevcut para birimleri için döviz kurlarını görüntüleyebilir.",
	"help-dialog": {
		"information-body": "Bu benim kişisel sayfam. Burada özgeçmişimi görüntüleyebilir, projelerimi inceleyebilir ve bu işletim sistemi içinde sunduğum küçük 'uygulamaları' çalıştırabilirsiniz.",
		"information-title": "Bilgi",
		"tips": {
			"feedback-body": "Geri bildiriminiz değerli! Herhangi bir sorunla karşılaşırsanız veya öneriniz olursa lütfen bana bildirin.",
			"feedback-title": "Geri Bildirim:",
			"navigation-body": "Farklı bölümlere ve uygulamalara erişmek için Başlat Menüsünü kullanın.",
			"navigation-title": "Navigasyon:",
			"responsiveness-body": "Arayüz çeşitli ekran boyutlarında iyi çalışacak şekilde tasarlanmıştır, ancak en iyi deneyim için masaüstü veya dizüstü bilgisayar kullanın.",
			"responsiveness-title": "Arayüz:",
			"shortcuts-body": "Daha hızlı gezinmek için klavye kısayolları mevcuttur. Menü öğelerinde altı çizili harflere dikkat edin.",
			"shortcuts-title": "Kısayollar:"
		},
		"tips-title": "İpuçları",
		"title": "Yazılım Geliştirici"
	},
	"introduction": {
		"about-current-job": "Şu anda, Etstur'da Yazılım Geliştirme Uzman Yardımcısı olarak çalışıyorum. Şirketin React bazlı B2B web uygulamarının geliştirilmesinde rol alıyorum.",
		"about-experience": "Yazılım geliştirmeye oldukça ilgi duyduğum için, hedeflediğim kariyere öğrencilik dönemimde online içerikler tüketerek ile ve HackerRank vb. sitelerde testler çözerek yatırım yaptım.",
		"about-me": "Ege Üniversitesi, İngiliz Dili ve Edebiyatı mezunuyum.",
		"about-preferences": "Genel olarak web uygulamalarını TypeScript ve React.js ile geliştirmeyi tercih ediyorum. Yaptığım geliştirmeleri Vitest ve react-testing-library ile, bazen de Playwright ile test ediyorum.",
		"menu": {
			"resume": "Özgeçmiş"
		}
	},
	"login-screen": {
		"footer-info": "Giriş yaptıktan sonra kullanıcı hesabı ekleyebilir veyak kullanıcıyı değiştirebilirsiniz.",
		"instructions": "Başlamak için lütfen şifrenizi giriniz",
		"turn-off": "Bilgisayarı kapat"
	},
	"shutdown": {
		"message": "Emin misiniz?",
		"option-restart": "Sayfayı yeniden başlat",
		"option-shutdown": "Sayfayı kapat",
		"title": "Kapat"
	},
	"vigenere-cipher": {
		"alphabet": "Alfabe",
		"alphabet-disabled-tooltip": "Alfabe şimdilik Latin harfleriyle sınırlandırılmıştır",
		"decrypt": "Şifre Çöz",
		"encrypt": "Şifrele",
		"input": "Girdi",
		"key": "Anahtar",
		"key-descripton": "'{{method}}' yöntemi için kullanacağınız anahtar",
		"method": "Yöntem",
		"output": "Çıktı",
		"title": "Vigenère Şifrelemesi"
	}
}
